hdscmcu/hc32f120/驱动库及样例/hc32f120_ddl/mcu/EWARM/HDSC_HC32F120.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>INTC</name>
            <description>desc INTC</description>
            <baseAddress>0x40011000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x100</size>
            </addressBlock>
            <registers>
                <register>
                    <name>NMICR</name>
                    <description>desc NMICR</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xB1</resetMask>
                    <fields>
                        <field>
                            <name>NMITRG</name>
                            <description>desc NMITRG</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NMIFCLK</name>
                            <description>desc NMIFCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NMIFEN</name>
                            <description>desc NMIFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NMIER</name>
                    <description>desc NMIER</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>NMIEN</name>
                            <description>desc NMIEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTALSTPEN</name>
                            <description>desc XTALSTPEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWDTEN</name>
                            <description>desc SWDTEN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVDEN</name>
                            <description>desc PVDEN</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NMIFR</name>
                    <description>desc NMIFR</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>NMIF</name>
                            <description>desc NMIF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>XTALSTPF</name>
                            <description>desc XTALSTPF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SWDTF</name>
                            <description>desc SWDTF</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PVDF</name>
                            <description>desc PVDF</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NMICLR</name>
                    <description>desc NMICLR</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>NMICL</name>
                            <description>desc NMICL</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTALSTPCL</name>
                            <description>desc XTALSTPCL</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWDTCL</name>
                            <description>desc SWDTCL</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVDCL</name>
                            <description>desc PVDCL</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EVTER</name>
                    <description>desc EVTER</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>EVTEN0</name>
                            <description>desc EVTEN0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTEN1</name>
                            <description>desc EVTEN1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTEN2</name>
                            <description>desc EVTEN2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTEN3</name>
                            <description>desc EVTEN3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTEN4</name>
                            <description>desc EVTEN4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTEN5</name>
                            <description>desc EVTEN5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTEN6</name>
                            <description>desc EVTEN6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVTEN7</name>
                            <description>desc EVTEN7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EKEYCR</name>
                    <description>desc EKEYCR</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F</resetMask>
                    <fields>
                        <field>
                            <name>EKEY0EN</name>
                            <description>desc EKEY0EN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EKEY1EN</name>
                            <description>desc EKEY1EN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EKEY2EN</name>
                            <description>desc EKEY2EN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EKEY3EN</name>
                            <description>desc EKEY3EN</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EKEY4EN</name>
                            <description>desc EKEY4EN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EKEY5EN</name>
                            <description>desc EKEY5EN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FPRCR</name>
                    <description>desc FPRCR</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>FPRC</name>
                            <description>desc FPRC</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQCR0</name>
                    <description>desc EIRQCR0</description>
                    <addressOffset>0x40</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xB3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIRQFCLK</name>
                            <description>desc EIRQFCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIRQFEN</name>
                            <description>desc EIRQFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQCR1</name>
                    <description>desc EIRQCR1</description>
                    <addressOffset>0x44</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xB3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIRQFCLK</name>
                            <description>desc EIRQFCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIRQFEN</name>
                            <description>desc EIRQFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQCR2</name>
                    <description>desc EIRQCR2</description>
                    <addressOffset>0x48</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xB3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIRQFCLK</name>
                            <description>desc EIRQFCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIRQFEN</name>
                            <description>desc EIRQFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQCR3</name>
                    <description>desc EIRQCR3</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xB3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIRQFCLK</name>
                            <description>desc EIRQFCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIRQFEN</name>
                            <description>desc EIRQFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQCR4</name>
                    <description>desc EIRQCR4</description>
                    <addressOffset>0x50</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xB3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIRQFCLK</name>
                            <description>desc EIRQFCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIRQFEN</name>
                            <description>desc EIRQFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQCR5</name>
                    <description>desc EIRQCR5</description>
                    <addressOffset>0x54</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xB3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIRQFCLK</name>
                            <description>desc EIRQFCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIRQFEN</name>
                            <description>desc EIRQFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQCR6</name>
                    <description>desc EIRQCR6</description>
                    <addressOffset>0x58</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0xB3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIRQFCLK</name>
                            <description>desc EIRQFCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EIRQFEN</name>
                            <description>desc EIRQFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
